{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "blog",
	"expired": false,
	"items": [
		{
			"id": "./gen/gyro.html",
			"url": "./gen/gyro.html",
			"title": "I'm Using Tilt Controls!",
			"content_html": "<!DOCTYPE html>\n<html xmlns=\"http://www.w3.org/1999/xhtml\" lang=\"\" xml:lang=\"\">\n<head>\n  <meta charset=\"utf-8\" />\n  <meta name=\"generator\" content=\"pandoc\" />\n  <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=yes\" />\n  <title>I’m Using Tilt Controls!</title>\n  <style>\n      code{white-space: pre-wrap;}\n      span.smallcaps{font-variant: small-caps;}\n      span.underline{text-decoration: underline;}\n      div.column{display: inline-block; vertical-align: top; width: 50%;}\n  </style>\n  <link rel=\"stylesheet\" href=\"../styles/common.css\" />\n  <!--[if lt IE 9]>\n    <script src=\"//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv-printshiv.min.js\"></script>\n  <![endif]-->\n</head>\n<body>\n<a href=\"../index.html\">&laquo; blog</a>\n<header id=\"title-block-header\">\n<h1 class=\"title\">I’m Using Tilt Controls!</h1>\n</header>\n<nav id=\"TOC\" role=\"doc-toc\">\n<ul>\n<li><a href=\"#what-is-gyro-control\" id=\"toc-what-is-gyro-control\">What\nis Gyro Control</a></li>\n<li><a href=\"#how-do-i-use-gyro-control\"\nid=\"toc-how-do-i-use-gyro-control\">How Do I Use Gyro Control?</a></li>\n<li><a href=\"#hybrid-gamepad-gyro-vs-using-mouse-and-keyboard-binds\"\nid=\"toc-hybrid-gamepad-gyro-vs-using-mouse-and-keyboard-binds\">Hybrid\nGamepad + Gyro vs Using Mouse and Keyboard Binds</a>\n<ul>\n<li><a href=\"#an-example\" id=\"toc-an-example\">An Example</a></li>\n</ul></li>\n<li><a href=\"#i-dont-have-a-controller-which-one-should-i-buy\"\nid=\"toc-i-dont-have-a-controller-which-one-should-i-buy\">I Don’t Have a\nController, Which One Should I Buy?</a></li>\n<li><a href=\"#configuration\" id=\"toc-configuration\">Configuration</a>\n<ul>\n<li><a href=\"#flick-stick\" id=\"toc-flick-stick\">Flick Stick</a></li>\n<li><a href=\"#gyro-ratcheting\" id=\"toc-gyro-ratcheting\">Gyro\nRatcheting</a></li>\n<li><a href=\"#sensitivity\" id=\"toc-sensitivity\">Sensitivity</a></li>\n<li><a href=\"#d-to-2d\" id=\"toc-d-to-2d\">3D to 2D</a></li>\n</ul></li>\n<li><a href=\"#tangent-about-tf2\" id=\"toc-tangent-about-tf2\">Tangent\nAbout TF2</a></li>\n<li><a href=\"#in-conclusion\" id=\"toc-in-conclusion\">In\nConclusion,</a></li>\n</ul>\n</nav>\n<h1 id=\"what-is-gyro-control\">What is Gyro Control</h1>\n<p>“Gyro control” promises <a\nhref=\"https://www.youtube.com/watch?v=krQ_ggZcN1Q\">mouse-like precision\nwithout aim assist</a> by using very small movements of the controller\nas input, almost always as an alternative to aiming with the right\nanalog stick. This is great for me, because I’ve found that I never want\nto play games at my desk with the mouse and keyboard when I’ve already\nbeen sitting at my desk on mouse and keyboard all day. If I’m going to\nplay a game I want to relax, playing on the projector and a\ncontroller.</p>\n<p>Even if you like mouse and keyboard, this gives you another option.\nIt’s fun. It’s intuitive, people already jerk their controller around\nwhile playing games, why not make that an input?</p>\n<p>The best part is, if you own a modern controller, you can (probably)\ntry it without buying anything else.</p>\n<h1 id=\"how-do-i-use-gyro-control\">How Do I Use Gyro Control?</h1>\n<p>Using Gyro controls requires two things. First, any controller with a\ngyro sensor. Switch Pro controllers, Dualshock 4s, and DualSense\ncontrollers all have gyro, many third party controllers like 8BitDo Pro\nmodels do too. Notably, Xbox controllers do not.</p>\n<p>Next, you need <em>some kind</em> of gyro controller support. Modern\nconsoles (not the Xbox) have pretty good gyro support. Counterstrike 2,\nFortnite, and Apex Legends, all support gyro. If you play primarily on a\nconsole, the rest of the post won’t be relevant to you, stop reading and\njust go try it out.</p>\n<p>Unfortunately, native gyro support mostly sucks. Games will support\none modern controller, like the DualSense, and completely break with\nanother, like the Switch Pro. Even when it doesn’t suck, the\nimplementation of gyro support isn’t standardized. Availability of\ncustomization options is extremely inconsistent. Some games only support\none type of camera movement, some don’t have flick stick (we’ll get to\nthis later). None of this matters because on Steam <strong>if the game\nsupports mouse and keyboard, it supports Gyro.</strong> Non-Steam games\ncan be added to your Steam library, allowing you to use Steam Input.\nOutside of Steam you can use <a\nhref=\"https://github.com/Electronicks/JoyShockMapper\">JoyShockMapper</a>\n(free, more work) or <a\nhref=\"https://www.rewasd.com/releases/release-5.3.0\">reWASD</a>, which\nis a subscription service, but supposedly the most convenient and\nfeature complete.</p>\n<h1 id=\"hybrid-gamepad-gyro-vs-using-mouse-and-keyboard-binds\">Hybrid\nGamepad + Gyro vs Using Mouse and Keyboard Binds</h1>\n<p>There is a hybrid approach where the game still behaves like you have\na gamepad oustide of letting you use gyro aim. At time of writing, this\ndoesn’t work well for me. I get weird little bugs, gyro doesn’t work,\nthe game gets very confused about whether you’re using gamepad or mouse,\ninstability, bugs. This is especially bad if the gamepad implementation\nwas a bit half baked, which it often is in older games. So I just map\neverything in the controller to the equivalent default keyboard mapping\nfor the game. The downside of just emulating mouse and keyboard is you\nlose button glyphs, so you’ll see “hit E” instead of “press A”. I don’t\ncare about this, some people do.</p>\n<h2 id=\"an-example\">An Example</h2>\n<p>In Helldivers 2, without Steam Input, gyro did not work. With Steam\nInput, the native support fought steam input, and weird buggy behavior\nwas common. Mostly this meant staring into the sun while fumbling with\nconfigs and being eaten by bugs / turned into a picnic table by chainsaw\nrobots. So I just mapped everything on the controller to Mouse and\nKeyboard and it worked perfectly. By convincing the game you’re just\nusing the default mouse and keyboard, you get the best supported control\nscheme and you can reuse your tuned personal gyro settings across games\nwithout having to petition the devs for better support and feature\nparity with whatever your favorite implementation of gyro is. Reddit is\nfull of people begging some dev for some gyro feature, but you can just\nlie to the computer instead. Mouse and keyboard provides us with a\nperfect interface already, why bother with native support?</p>\n<p>I hear some people are good at making hybrid setups work, so I think\nit might be worth trying the couple most popular Steam Community\nlayouts. I may update this later, but I haven’t tried a hybrid layout\nyet that “just worked”.</p>\n<h1 id=\"i-dont-have-a-controller-which-one-should-i-buy\">I Don’t Have a\nController, Which One Should I Buy?</h1>\n<p>I would caution against buying a third party controller unless you\nwant to deal with <em>even more</em> config finagling than you normally\nhave to with gyro. You might not get recommended layouts for Steam, your\nOS might not recognize it (or if you’re on Linux, you might have to deal\nwith 💀 linux driver issues 💀). If you’re crazy you could spend $200 on\na DualSense Edge. If you have an old DualShock 4 lying around, that\ncould work. Outside of that, your options are the DualSense and the\nSwitch Pro.</p>\n<p>Reddit generally likes the DualSense. <a\nhref=\"https://youtu.be/CenJLOTGxLc?si=jUzV9cW4qZuQj_7o&amp;t=946\">Youtuber\n“Nerrell” found that the Switch Pro was a little more accurate</a>, I’ve\nseen a couple other people compare the modern options and find that the\nSwitch Pro is a <em>little</em> better. I own a Switch, so I bought the\nPro, and let me tell you, it does not have enough buttons. The DualSense\nhas the whole pad there to map gesture controls, and I get the\nimpression it generally gets better support. The Pro controller has no\ninputs beyond what you would expect from an old 360 controller. That\nbeing said, Steam Input gives us the ability to deal with the lack of\nbuttons. Creating mode switches (or layers? or I think they made a third\nthing?) in order to access more binds when some button is held is good\nenough. Steam also lets you do things like map clicking a button once to\none key, twice to another, and holding the button to a third, which is\npretty useful for making one button deal with, for example, diving for\ncover (single tap), go prone (double tap), and crouch (hold).</p>\n<p>Anyway, I bought the controller from Pink Gorilla, a local shop that\nI’m always surprised is still chugging along, so I don’t want to return\nit.</p>\n<p>If you want a little more convenience and some more features, buy a\nDualSense. If you want marginally more accuracy, get a Switch Pro\nController. If you already own a Switch (which is more likely than\nowning a PS5 if you consider their sales figures, <a\nhref=\"https://www.youtube.com/watch?v=UtG11pmBe3U\">etc</a>), you might\nas well get the controller compatible with it.</p>\n<h1 id=\"configuration\">Configuration</h1>\n<p>You could just settle for native support or Steam Community suggested\nlayouts (if any are present for your game), but you’ll probably have to\nconfigure some stuff yourself. There are a <a\nhref=\"https://www.reddit.com/r/GyroGaming/comments/198wq0y/new_to_gyro_gaming_start_here_gyro_beginners_guide/\">lot</a>\nof <a href=\"https://www.youtube.com/watch?v=D0uSfda_-Rc\">guides</a> out\nthere that go into great detail, so I’m going to trust those to be\nbetter up-to-date comprehensive sources. Here I’m just going to hit a\ncouple very common changes you might make, or situations you might find\nyourself in.</p>\n<h2 id=\"flick-stick\">Flick Stick</h2>\n<p>This is probably the most important setting. Once you’ve freed up\nyour right stick, you can use it to make very large movements (like\nfully turning around) instantly rather than aiming. This is very useful,\nas those large movements are kind of annoying otherwise.</p>\n<h2 id=\"gyro-ratcheting\">Gyro Ratcheting</h2>\n<p>Ratcheting refers to the ability to disable the gyro briefly so you\ncan move the controller back to a neutral position without moving the\ngame’s camera. I often map this to my mode switch button.</p>\n<p>For some reason, in Steam Input you don’t set a gyro disable\nbutton,you set a gyro enable button (even if gyro is always on) and set\nthe behavior of the enable button to be disabling the gyro. Intuitive!\n<a\nhref=\"https://www.reddit.com/r/GyroGaming/comments/ug54tk/comment/i6xgli4/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">Credit</a></p>\n<h2 id=\"sensitivity\">Sensitivity</h2>\n<p>You’re probably going to start with the sensitivity too low while\nyou’re getting used to it. This is fine. Eventually you’ll probably get\ntired of making big movements and turn it up.</p>\n<h2 id=\"d-to-2d\">3D to 2D</h2>\n<p>For some reason Steam Input defaults to just using “Yaw”, reading\ninput from how the controller is turned or tipped. You probably also\nwant to use “Roll”, which reads how the controller is “twisted” as well.\nIf it makes sense to you that you should be able to turn the controller\nso the top faces left when you want to turn left, use “Roll” as well.\nTry out the settings, reading about them is very abstract, when you\nactually try the different options you will immediately understand how\nthey work, and if you’re anything like me, one setting will seem\nobviously right and the rest obviously wrong. If you want to read about\nit anyway, <a\nhref=\"http://gyrowiki.jibbsmart.com/blog:player-space-gyro-and-alternatives-explained\">here\nyou go</a>.</p>\n<h1 id=\"tangent-about-tf2\">Tangent About TF2</h1>\n<p><a href=\"https://youtu.be/PJIqEX93vL8?si=sOfHWUPpjs1eLp4c\">This\nvideo</a> prompted me to look into gyro controls, naturally I tried to\nmake them work in TF2 first. The config shown in the video is available\nand extremely popular, but it didn’t work for me immediately. The\ninventory would open and then instantly close as if it was getting two\ninputs. Long story short, disabling gamepad in settings seemed to did\nnothing, console commands either did nothing or broke it, what worked\nwas finding the Xbox 360 controller config text file and commenting\neverything out (deleting the contents would also work).</p>\n<p>For anyone else running into this, the file lives at:</p>\n<p><code>SteamLibrary\\steamapps\\common\\TeamFortress2\\tf\\cfg\\360controller.cfg</code></p>\n<p>So, if you want to play old, exceptionally buggy games with half\nbaked features in a way that they were never meant to be played, you may\nhave to do this sort of thing.</p>\n<h1 id=\"in-conclusion\">In Conclusion,</h1>\n<p>If this guide convinced you to try Gyro controls, send me a message\non Github telling me how long you spent futzing with configurations and\nI’ll chuckle knowingly while shaking my head.</p>\n</body>\n</html>\n",
			"summary": "And you should too.",
			"date_published": "2025-02-08T01:32:56+00:00"
		}
	]
}