{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "blog",
	"expired": false,
	"items": [
		{
			"id": "./gen/gyro.html",
			"url": "./gen/gyro.html",
			"title": "I'm Using Tilt Controls! And You Should Too",
			"content_html": "<!DOCTYPE html>\n<html xmlns=\"http://www.w3.org/1999/xhtml\" lang=\"\" xml:lang=\"\">\n<head>\n  <meta charset=\"utf-8\" />\n  <meta name=\"generator\" content=\"pandoc\" />\n  <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=yes\" />\n  <title>I’m Using Tilt Controls! And You Should Too</title>\n  <style>\n      code{white-space: pre-wrap;}\n      span.smallcaps{font-variant: small-caps;}\n      span.underline{text-decoration: underline;}\n      div.column{display: inline-block; vertical-align: top; width: 50%;}\n  </style>\n  <link rel=\"stylesheet\" href=\"../styles/common.css\" />\n  <!--[if lt IE 9]>\n    <script src=\"//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv-printshiv.min.js\"></script>\n  <![endif]-->\n</head>\n<body>\n<a href=\"../index.html\">&laquo; blog</a>\n<header id=\"title-block-header\">\n<h1 class=\"title\">I’m Using Tilt Controls! And You Should Too</h1>\n<p class=\"date\">2025-02-08T01:32:56Z</p>\n</header>\n<nav id=\"TOC\" role=\"doc-toc\">\n<ul>\n<li><a href=\"#what-is-gyro-control-and-why-should-i-care\"\nid=\"toc-what-is-gyro-control-and-why-should-i-care\">What is Gyro Control\nand Why Should I Care</a></li>\n<li><a href=\"#how-do-i-use-gyro-control\"\nid=\"toc-how-do-i-use-gyro-control\">How Do I Use Gyro Control?</a></li>\n<li><a href=\"#hybrid-default-gamepad-gyro\"\nid=\"toc-hybrid-default-gamepad-gyro\">Hybrid Default Gamepad +\nGyro</a></li>\n<li><a href=\"#gyro-gamepad-as-mouse-keyboard\"\nid=\"toc-gyro-gamepad-as-mouse-keyboard\">Gyro Gamepad as Mouse +\nKeyboard</a></li>\n<li><a href=\"#i-dont-have-a-controller-which-one-should-i-buy\"\nid=\"toc-i-dont-have-a-controller-which-one-should-i-buy\">I Don’t Have a\nController, Which One Should I Buy?</a></li>\n<li><a href=\"#configuration\" id=\"toc-configuration\">Configuration</a>\n<ul>\n<li><a href=\"#flick-stick\" id=\"toc-flick-stick\">Flick Stick</a></li>\n<li><a href=\"#gyro-ratcheting\" id=\"toc-gyro-ratcheting\">Gyro\nRatcheting</a></li>\n<li><a href=\"#sensitivity\" id=\"toc-sensitivity\">Sensitivity</a></li>\n<li><a href=\"#d-to-2d\" id=\"toc-d-to-2d\">3d to 2d</a></li>\n</ul></li>\n<li><a href=\"#tangent-about-tf2\" id=\"toc-tangent-about-tf2\">Tangent\nAbout TF2</a></li>\n<li><a href=\"#in-conclusion\" id=\"toc-in-conclusion\">In\nConclusion,</a></li>\n</ul>\n</nav>\n<h1 id=\"what-is-gyro-control-and-why-should-i-care\">What is Gyro Control\nand Why Should I Care</h1>\n<p>“Gyro control” promises <a\nhref=\"https://www.youtube.com/watch?v=krQ_ggZcN1Q\">mouse-like precision\nwithout aim assist</a>. This is great for me, because I’ve found that I\nnever want to play games at my desk with the mouse and keyboard when\nI’ve already been sitting at my desk on mouse and keyboard all day. If\nI’m going to play a game I want to relax, playing on the projector and a\ncontroller. When I buy games without controller support, I basically\nnever play them. I assumed this meant I’d have to write off a lot of\ngames, but apparently you <a\nhref=\"https://youtu.be/PJIqEX93vL8?si=sOfHWUPpjs1eLp4c\">can even play\nTeam Fortress 2</a> with gyro controls just fine.</p>\n<p>Even if you like mouse and keyboard, this gives you another option.\nAnd it’s fun, it’s intuitive, people already jerk their controller\naround while playing games, why not make that an input?</p>\n<p>The best part is, if you own a modern controller, you can (probably)\ntry it without buying anything else.</p>\n<h1 id=\"how-do-i-use-gyro-control\">How Do I Use Gyro Control?</h1>\n<p>Using Gyro controls requires two things. First, any controller with a\ngyro sensor. Switch Pro controllers, Dualshock 4s, and DualSense\ncontrollers all have gyro, many third party controllers like 8BitDo Pro\nmodels do too. Notably, Xbox controllers do not.</p>\n<p>Next, you need <em>some kind</em> of gyro controller support. Modern\nconsoles (not the Xbox) have pretty good gyro support. Counterstrike 2,\nFortnite, and Apex Legends, all support gyro. If you play primarily on a\nconsole, the rest of the post won’t be relevant to you, just go try it\nout, you don’t have to read the rest of this post.</p>\n<p>Unfortunately, native gyro support mostly sucks. Games will support\none modern controller, like the DualSense, and completely break with\nanother, like the Switch Pro. Even when it doesn’t suck, the\nimplementation of gyro support isn’t standardized. Availability of\ncustomization options is extremely inconsistent. Some games only support\none type of camera movement, some don’t have flick stick (we’ll get to\nthis later). None of this matters because on Steam <strong>if the game\nsupports mouse and keyboard, it supports Gyro.</strong> Outside of Steam\nyou can use <a\nhref=\"https://github.com/Electronicks/JoyShockMapper\">JoyShockMapper</a>\n(free, more work) or <a\nhref=\"https://www.rewasd.com/releases/release-5.3.0\">reWASD</a>, which\nis a subscription service, but supposedly the most convenient.</p>\n<h1 id=\"hybrid-default-gamepad-gyro\">Hybrid Default Gamepad + Gyro</h1>\n<p>Before I talk about this I should mention that there is a hybrid\napproach where the game still behaves like you have a gamepad oustide of\nletting you use gyro aim. At time of writing, this doesn’t work well for\nme. I get weird little bugs, gyro doesn’t work, the game gets very\nconfused about whether you are using mouse and keyboard or gamepad, some\nmenus won’t open. This is especially bad if the gamepad implementation\nwas a bit half baked, which it often is in older games. So I just map\neverything in the controller to the equivalent default keyboard mapping\nfor the game. The downside of just emulating mouse and keyboard is you\nlose button glyphs, so you’ll see “hit E” instead of “press A”. I don’t\ncare about this, some people do.</p>\n<p>I hear some people are good at making hybrid setups work, so I think\nit might be worth trying the couple most popular Steam Community\nlayouts. I may update this later, but I haven’t tried a hybrid layout\nyet that “just worked”. Maybe this will change in the future! But for\nnow, I want to talk about my favorite approach.</p>\n<h1 id=\"gyro-gamepad-as-mouse-keyboard\">Gyro Gamepad as Mouse +\nKeyboard</h1>\n<p>In Helldivers 2, without Steam Input, gyro did not work. With Steam\nInput, the native support fought steam input, and weird buggy behavior\nwas common. Mostly this meant staring into the sun while fumbling with\nconfigs and being eaten by bugs / chainsawed / lasered. So I just mapped\neverything on the controller to Mouse and Keyboard and it worked\nperfectly. By convincing the game you’re just using the default mouse\nand keyboard, you get the best supported control scheme and you can\nreuse your tuned personal gyro settings across games without having to\npetition the devs for better support and feature parity with whatever\nyour favorite implementation of gyro is. Reddit is full of people\nbegging some dev for some gyro feature, just lie to the computer\ninstead. Mouse and keyboard provides us with a perfect interface\nalready, why bother with native support?</p>\n<h1 id=\"i-dont-have-a-controller-which-one-should-i-buy\">I Don’t Have a\nController, Which One Should I Buy?</h1>\n<p>I wouldn’t buy a third party controller unless you want to deal with\n<em>even more</em> config finagling than you normally have to do with\ngyro. You might not get recommended layouts for Steam, your OS might not\nrecognize it (or if you’re on Linux, you might have to deal with 💀\nlinux driver issues 💀).</p>\n<p>If you’re crazy you could buy spend $200 on a DualSense Edge. Outside\nof that, your options are the DualSense, the DualShock 4, and the Switch\nPro.</p>\n<p>Reddit generally likes the DualSense. <a\nhref=\"https://youtu.be/CenJLOTGxLc?si=jUzV9cW4qZuQj_7o&amp;t=946\">Youtuber\n“Nerrell” found that the Switch Pro was a little more accurate</a>, I’ve\nseen a couple other people test them and find that the Switch Pro is a\n<em>little</em> better. Also, I own a Switch. So I bought the Switch\nPro, and let me tell you, it does not have enough buttons. The DualSense\nhas the whole pad there to map gesture controls, and I get the\nimpression it is better supported on some games. Maybe if I bought that\ninstead I wouldn’t have experience any weird issues and I wouldn’t even\nhave bothered writing this at all! But you can just create mode switches\nin Steam Input (or layers? or I think they made a third thing?) in order\nto access more buttons (provided you’re holding one), and it’s good\nenough. Steam also lets you do things like map clicking once to one key,\ntwice to another, and click and hold to another, which is pretty useful\nfor making one button deal with, for example, my bindings for Helldivers\n2: dive for cover (single tap), go prone (double tap), and crouch\n(hold).</p>\n<p>Anyway, I bought the controller from Pink Gorilla, a small local shop\nthat I’m always surprised is still chugging along, so I don’t want to\nreturn it.</p>\n<p>I tried to get an old DualShock 4 from a friend to connect to the\ncomputer, but it would randomly disconnect, your mileage may vary\nthere.</p>\n<p>If you want a little more convenience and some more features, buy a\nDualSense. If you want marginally more accuracy, get a Switch Pro\nController. If you already own a Switch (which is more likely than\nowning a PS5 if you consider their sales figures, <a\nhref=\"https://www.youtube.com/watch?v=UtG11pmBe3U\">etc</a>), you might\nas well get the controller compatible with it.</p>\n<h1 id=\"configuration\">Configuration</h1>\n<p>You could just settle for native support or Steam Community suggested\nlayouts (if any are present for your game), but you’ll probably have to\nconfigure some stuff yourself. There are a <a\nhref=\"https://www.reddit.com/r/GyroGaming/comments/198wq0y/new_to_gyro_gaming_start_here_gyro_beginners_guide/\">lot</a>\nof <a href=\"https://www.youtube.com/watch?v=D0uSfda_-Rc\">guides</a> out\nthere that go into great detail, so I’m going to trust those to be\nbetter up-to-date comprehensive sources. Here I’m just going to hit a\ncouple very common changes you might make, or situations you might find\nyourself in.</p>\n<h2 id=\"flick-stick\">Flick Stick</h2>\n<p>This is probably the most important setting. Once you’ve freed up\nyour right stick from looking around, you can use it to instead allow\nyou to make very large movements (like fully turning around) instantly.\nThis is very useful, as those huge movements are kind of annoying\notherwise.</p>\n<h2 id=\"gyro-ratcheting\">Gyro Ratcheting</h2>\n<p>Ratcheting refers to the ability to disable the gyro briefly so you\ncan move the controller back to a neutral position without moving the\ngame’s camera. I often map this to my mode switch button.</p>\n<p>For some reason, in Steam Input you don’t set a gyro disable\nbutton,you set a gyro enable button (even if gyro is always on) and set\nthe behavior of the button to… disabling gyro? <a\nhref=\"https://www.reddit.com/r/GyroGaming/comments/ug54tk/comment/i6xgli4/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">Credit</a></p>\n<h2 id=\"sensitivity\">Sensitivity</h2>\n<p>You’re probably going to start with the sensitivity too low while\nyou’re getting used to it. This is fine. Eventually you’ll probably get\ntired of making big movements and turn it down.</p>\n<h2 id=\"d-to-2d\">3d to 2d</h2>\n<p>For some reason Steam Input default to just using “Yaw”, reading\ninput from how the controller is rotated or tilted. You probably also\nwant to use “Roll”, which reads how the controller is “twisted” or\n“tipped” as well. If it makes sense to you that turning the controller\nso the top faces left when you want to turn left, use “Roll” as well.\nJust try them out, reading it is very abstract, but when you actually\ntry the different options you will immediately understand how they work,\nand if you’re anything like me, one setting will seem obviously right\nand the rest obviously wrong. But if you want to read about it anyway,\n<a\nhref=\"http://gyrowiki.jibbsmart.com/blog:player-space-gyro-and-alternatives-explained\">here\nyou go</a>.</p>\n<h1 id=\"tangent-about-tf2\">Tangent About TF2</h1>\n<p>Remember <a href=\"https://www.youtube.com/watch?v=PJIqEX93vL8\">that\nTF2 video</a> I mentioned? That guy’s controller config is available,\nand extremely popular! But it didn’t work for me immediately. TF2 has\nreally weird gamepad support as covered in that video, this caused me\nissues. The inventory would open and then instantly close as if it was\ngetting two inputs. Long story short, disabling gamepad in settings\nseemed to do nothing, console commands either did nothing or broke it,\nwhat worked was finding the Xbox 360 controller config text file and\ncommenting everything out (deleting the contents would also work).</p>\n<p>For anyone else running into this, the file lives at\n<code>SteamLibrary\\steamapps\\common/TeamFortress2\\tf\\cfg\\360controller.cfg</code></p>\n<p>So, if you want to play old, exceptionally buggy games with half\nbaked features in a way that they were never meant to be played, you may\nhave to do some of that sort of thing.</p>\n<h1 id=\"in-conclusion\">In Conclusion,</h1>\n<p>If this guide convinced you to try Gyro controls, send me a message\non Github telling me how many hours you spent futzing with\nconfigurations and I’ll chuckle knowingly while shaking my head.</p>\n</body>\n</html>\n",
			"summary": "Doing normal things in needlessly silly ways.",
			"date_published": "2025-02-08T01:32:56+00:00"
		}
	]
}